# EndPoints Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SlabShapeCrease..::..EndPoints Property
SlabShapeCrease Class See Also
---
The vertices of the crease.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public SlabShapeVertexArray EndPoints { get; }
```

Visual Basic
---
```text
Public ReadOnly Property EndPoints As SlabShapeVertexArray
	Get
```

Visual C++
---
```text
public:
property SlabShapeVertexArray^ EndPoints {
	SlabShapeVertexArray^ get ();
}
```

# See Also
SlabShapeCrease Class
Autodesk.Revit.DB Namespace